tap "aws/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"

# Taps
brew "aws/tap/aws-sam-cli"
brew "github/gh/gh"
brew "mongodb/brew/mongodb-community"

#  Packages
brew "awscli"
brew "curl"
brew "git"
brew "git-gui"
brew "git-when-merged"
brew "python"
brew "gradle"
brew "hub"
brew "jq"
brew "kotlin"
brew "mackup"
brew "maven"
brew "node"
brew "nvm"
brew "postgresql"
brew "sonar-scanner"
brew "tree"
brew "wget"
brew "yq"
brew "github/gh/gh"

# Fonts
cask "font-hack-nerd-font"

# Applications
cask "google-chrome"
cask "intellij-idea-ce"
cask "spotify"
cask "iterm2"
cask "firefox"
cask "pgadmin4"
cask "robo-3t"
cask "sublime-text"
cask "visual-studio-code"