tap "aws/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"

# Taps
brew "aws/tap/aws-sam-cli"
brew "github/gh/gh"
brew "mongodb/brew/mongodb-community"

#  Packages
brew "python@3.8"
brew "awscli"
brew "curl"
brew "docker", link: false
brew "fzf"
brew "git"
brew "git-gui"
brew "git-when-merged"
brew "googler"
brew "gradle"
brew "grep"
brew "hub"
brew "jenv"
brew "jq"
brew "kotlin"
brew "kubernetes-cli", link: false
brew "mackup"
brew "maven"
brew "minikube"
brew "neovim"
brew "node"
brew "nvm"
brew "packer"
brew "postgresql"
brew "sbt"
brew "scala"
brew "sonar-scanner"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "yarn"
brew "yq"
brew "aws/tap/aws-sam-cli"
brew "datawire/blackbird/telepresence"
brew "github/gh/gh"
brew "mongodb/brew/mongodb-community"
brew "txn2/tap/kubefwd"
brew "weaveworks/tap/eksctl"
cask "adoptopenjdk8"
cask "font-hack-nerd-font"
cask "visual-studio-code"
cask "xquartz"


# Fonts
cask "font-hack-nerd-font"

# Applications
cask "google-chrome"
cask "intellij-idea-ce"
cask "spotify"
cask "iterm2"
cask "firefox"
cask "pgadmin4"
cask "robo-3t"
cask "sublime-text"
cask "visual-studio-code"
